[
  {
    "movieId": "1",
    "image": "https://image.tmdb.org/t/p/w780/qUFVJZjK5KMM6m9jb8lLoORjd0r.jpg",
    "name": "Fantastic Four",
    "description": "Four young outsiders teleport to a dangerous universe, which alters their physical form in shocking ways. Their lives irrevocably upended, the team must learn to harness their daunting new abilities and work together to save Earth from a former friend turned enemy.",
    "rating": 4.4,
    "dateStart": null,
    "dateEnd": null,
    "watched": 80
  },
  {
    "movieId": "2",
    "image": "https://image.tmdb.org/t/p/w780/7FWlcZq3r6525LWOcvO9kNWurN1.jpg",
    "name": "Captain America: Civil War",
    "description": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
    "rating": 7.4,
    "dateStart": null,
    "dateEnd": null,
    "watched": 56
  },
  {
    "movieId": "3",
    "image": "https://image.tmdb.org/t/p/w780/en971MEXui9diirXlogOrPKmsEn.jpg",
    "name": "Deadpool",
    "description": "Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
    "rating": 7.6,
    "dateStart": null,
    "dateEnd": null,
    "watched": 33
  },
  {
    "movieId": "4",
    "image": "https://image.tmdb.org/t/p/w780/yEv8c6i79vk06sZDC3Z9D8HQLVV.jpg",
    "name": "Logan",
    "description": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
    "restriction": null,
    "rating": 7.8,
    "dateStart": null,
    "dateEnd": null,
    "watched": 8
  },
  {
    "movieId": "5",
    "image": "https://image.tmdb.org/t/p/w780/aJn9XeesqsrSLKcHfHP4u5985hn.jpg",
    "name": "Guardians of the Galaxy Vol. 2",
    "description": "The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage.",
    "rating": 7.6,
    "dateStart": null,
    "dateEnd": null,
    "watched": 5
  },
  {
    "movieId": "6",
    "image": "https://image.tmdb.org/t/p/w780/kaIfm5ryEOwYg8mLbq8HkPuM1Fo.jpg",
    "name": "Thor: Ragnarok",
    "description": "Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela.",
    "rating": 7.6,
    "dateStart": null,
    "dateEnd": null,
    "watched": 1
  },
  {
    "movieId": "7",
    "image": "https://image.tmdb.org/t/p/w780/vc8bCGjdVp0UbMNLzHnHSLRbBWQ.jpg",
    "name": "Spider-Man: Homecoming",
    "description": "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
    "rating": 7.4,
    "dateStart": null,
    "dateEnd": null,
    "watched": 0
  },
  {
    "movieId": "8",
    "image": "https://image.tmdb.org/t/p/w780/cKPfiu9IcCW0fMdKdQBXe3PRtTZ.jpg",
    "name": "The Dark Knight Rises",
    "description": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
    "rating": 7.7,
    "dateStart": "2021-01-02",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "9",
    "image": "https://image.tmdb.org/t/p/w780/srYya1ZlI97Au4jUYAktDe3avyA.jpg",
    "name": "Wonder Woman 1984",
    "description": "Wonder Woman comes into conflict with the Soviet Union during the Cold War in the 1980s and finds a formidable foe by the name of the Cheetah.",
    "rating": 7.3,
    "dateStart": "2021-01-02",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "10",
    "image": "https://image.tmdb.org/t/p/w780/qwgGtdlLMKYvT2tV8hLY22syRHN.jpg",
    "name": "Shazam!",
    "description": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
    "rating": 7.1,
    "dateStart": "2021-01-02",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "11",
    "image": "https://image.tmdb.org/t/p/w780/9QusGjxcYvfPD1THg6oW3RLeNn7.jpg",
    "name": "Aquaman",
    "description": "Once home to the most advanced civilization on Earth, Atlantis is now an underwater kingdom ruled by the power-hungry King Orm. With a vast army at his disposal, Orm plans to conquer the remaining oceanic people and then the surface world. Standing in his way is Arthur Curry, Orm's half-human, half-Atlantean brother and true heir to the throne.",
    "rating": 6.9,
    "dateStart": "2021-01-02",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "12",
    "image": "https://image.tmdb.org/t/p/w780/jorgjEk6a0bed6jdR5wu4S6ZvRm.jpg",
    "name": "Justice League",
    "description": "Fuelled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne and Diana Prince assemble a team of metahumans consisting of Barry Allen, Arthur Curry and Victor Stone to face the catastrophic threat of Steppenwolf and the Parademons who are on the hunt for three Mother Boxes on Earth.",
    "rating": 6.2,
    "dateStart": "2021-01-03",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "13",
    "image": "https://image.tmdb.org/t/p/w780/7CsoobQ9wzrVXPiqB15bDqEk9zG.jpg",
    "name": "Suicide Squad",
    "description": "From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
    "restriction": null,
    "rating": 5.9,
    "dateStart": "2021-01-03",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "14",
    "image": "https://image.tmdb.org/t/p/w780/doiUtOHzcxXFl0GVQ2n8Ay6Pirx.jpg",
    "name": "Batman v Superman: Dawn of Justice",
    "description": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
    "rating": 5.9,
    "dateStart": "2021-01-04",
    "dateEnd": "2021-02-01",
    "watched": 0
  },
  {
    "movieId": "15",
    "image": "https://image.tmdb.org/t/p/w780/64YOcrslrijllDRCpQvXkSKvXQV.jpg",
    "name": "War Horse",
    "description": "Follows a young man named Albert and his horse, Joey, and how their bond is broken when Joey is sold to the cavalry and sent to the trenches of World War One. Despite being too young to enlist, Albert heads to France to save his friend.",
    "rating": 7.3,
    "dateStart": "2021-01-04",
    "dateEnd": "2021-02-01",
    "watched": 0
  }
]